app/Models/MTampil.php

    public function saveData($tampil)
    {
        $query = $this->db->table('mahasiswa')->insert($tampil);
---
INSERT INTO `mahasiswa` (`nim`, `nama`, `fakultas`, `alamat`) VALUES ('356573754', 'fgsnbfbnfvbn', 'gdnsfgndfvn', '453657')

    public function hapusData($id)
    {
        $query = $this->db->table('mahasiswa')
        ->where('nim',$id)
        ->delete();
---
DELETE FROM `mahasiswa`
WHERE `nim` = '356573754'